Repository: open-eid/RIA-DigiDoc-iOS
Catalog: RIADigiDoc/Supporting files/Localizable.xcstrings
Source language: en
Languages: et

source: Add file
et: Lisa fail

source: Add more files
et: Lisa veel faile

source: Add signature
et: Lisa allkiri

source: Added recipients
et: Lisatud adressaadid

source: Additional information
et: Loe täpsemalt siit

# Additional information 2
source: Additional information
et: Lisainfo

source: Authentication certificate
et: Isikutuvastamise sertifikaat

source: Authentication in progress, please wait.
et: Autentimine käib, palun oodake.

source: Back
et: Tagasi

# Cades message
source: This container contains CAdES signature. You are not allowed to add or remove signatures to this container.
et: Tegemist on CAdES allkirja sisaldava ümbrikuga. Sellele ümbrikule ei saa allkirja lisada ega eemaldada.

# CAN length requirement
source: CAN-code must be %@ digits long
et: Ligipääsu number (CAN) peab olema %@-kohaline

# CAN number
source: ID-card access number (CAN)
et: ID-kaardi ligipääsu number (CAN)

# CAN number location
source: The 6-digit number is located under the document photo
et: 6-kohaline number asub dokumendil foto all

source: Cancel
et: Tühista

source: Cancel container removal
et: Katkesta ümbriku eemaldamine

source: Certificate details
et: Sertifikaadi detailid

source: Certificate has expired
et: Sertifikaat on aegunud

source: Certificate is valid until %@
et: Sertifikaat kehtib kuni %@

source: Certificate not yet valid
et: Sertifikaat pole veel kehtiv

source: Certificate status revoked
et: Sertifikaat on kehtetu

source: Change container name
et: Muuda ümbriku nime

# Change PIN
source: Change %@
et: Muuda %@

# Checkbox checked
source: checked
et: valitud

# Checkbox unchecked
source: unchecked
et: valimata

source: Choose a method of decryption
et: Vali dekrüpteerimise meetod

source: Choose a signing method
et: Vali allkirjastamise meetod

# Choose button
source: Choose
et: Vali

source: Choose country
et: Vali riik

source: Choose file
et: Vali fail

source: Citizenship
et: Kodakondsus

# City title
source: City
et: Linn

source: Clear text
et: Tühjenda tekst

source: Close
et: Sulge

source: Close container
et: Sulge ümbrik

source: ConcatKDF reference method
et: ConcatKDF referaatmeetod

source: Confirm container removal
et: Kinnita ümbriku eemaldamine

source: Container decryption
et: Ümbriku dekrüpteerimine

source: Container encryption
et: Ümbriku krüpteerimine

source: Container files
et: Ümbriku sisu

source: Container format
et: Ümbriku formaat

source: Container name
et: Ümbriku nimi

source: Container notification
et: Ümbriku teavitus

source: Container notifications
et: Ümbriku teavitused

source: Container recipients
et: Ümbriku adressaadid

source: Container signatures
et: Ümbriku allkirjad

source: Container signing
et: Ümbriku allkirjastamine

source: Container successfully decrypted!
et: Ümbrik edukalt dekrüpteeritud!

source: Container successfully encrypted!
et: Ümbrik edukalt krüpteeritud!

source: Continue
et: Jätka

source: Control code:
et: Kontrollkood:

source: Could not add %@ files
et: %@ faili lisamine ebaõnnestus

source: Could not load selected files
et: Failide laadimine ebaõnnestus

source: Country code and phone number
et: Riigikood ja telefoninumber

# Country code not included
source: Please include correct country code
et: Telefoninumber peab sisaldama riigikoodi

# Country title
source: Country
et: Riik

# Crypto files encrypted
source: To see the files, select «Decrypt» to identify the recipient and decrypt the envelope contents.
et: Failide nägemiseks vali «Dekrüpteeri», et tuvastada isik ja dekrüpteerida ümbriku sisu.

# Crypto recipients description
source: For encryption, at least one recipient must be included - the person (personal identification number) or authority (registration number, name or part of the name) authorised to decrypt the data. Add your own personal identification number if you want to decrypt the envelope later.
et: Krüpteerimiseks tuleb lisada vähemalt üks adressaat – isik (isikukood) või asutus (registrikood, nimi või nimeosa), kellel on õigus andmeid dekrüpteerida. Lisa enda isikukood, kui soovid hiljem ümbrikku dekrüpteerida.

source: Data read
et: Andmed loetud

source: Date of birth
et: Sünniaeg

source: Decrypt
et: Dekrüpteeri

source: Decrypt container
et: Dekrüpteeri dokument

source: Decryption method
et: Dekrüpteerimise meetod

source: Decryption method changed
et: Dekrüpteerimise meetod muudetud

# Document already exists
source: Document with same file name %@ already exists
et: Fail %@ on juba ümbrikus olemas

source: Document not found
et: Dokumenti ei leitud

source: Done
et: Valmis

# Empty file in container
source: An empty file is attached to the envelope. Remove the empty file from the container to sign.
et: Ümbrikule on lisatud tühi fail. Allkirjastamiseks eemalda ümbrikust tühi fail.

source: Encrypt
et: Krüpteeri

source: Encrypt container
et: Krüpteeri dokument

# Enter current PIN code
source: Enter current %1$@ code
et: Sisesta praegune %1$@-kood

# Enter new PIN code
source: Enter new %1$@ code
et: Sisesta uus %1$@-kood

source: Estonia
et: Eesti

# Exceeded unsuccessful requests
source: Failed to send request. The number of unsuccessful request from this IP address has been exceeded. Please try again later
et: Päringu saatmine ebaõnnestus. Sellelt IP-aadressilt on ebaõnnestunud päringute arv ületatud. Palun proovige mõne aja pärast uuesti

# Expired mobile-ID transaction
source: Your mobile-ID transaction has expired. Please try again
et: Sinu mobiil-ID toiming aegus. Palun proovi uuesti

# Expired Smart-ID transaction
source: Your Smart-ID transaction has expired or user account not found
et: Sinu Smart-ID toiming aegus või kontot ei leitud

# Failed mobile-ID transaction
source: Your mobile-ID transaction has failed. Please contact your mobile network operator
et: Sinu mobiil-ID toiming ebaõnnestus. Palun võta ühendust enda mobiilioperaatoriga

# Failed Smart-ID transaction
source: Your Smart-ID transaction has failed. Please check your Smart-ID application or contact Smart-ID customer support
et: Sinu Smart-ID toiming ebaõnnestus. Palun kontrolli Smart-ID rakendust või võta ühendust Smart-ID klienditoega

source: Failed to open container %@
et: Dokumendi %@ avamine ebaõnnestus

source: Failed to open file %@
et: Faili %@ avamine ebaõnnestus

source: Failed to read data
et: Andmete lugemine ebaõnnestus

source: Failed to remove file
et: Faili eemaldamine ebaõnnestus

source: Failed to remove file %@ from container
et: Faili %@ eemaldamine ümbrikust ebaõnnestus

source: Failed to remove recipient
et: Adressaati eemaldamine ebaõnnestus

source: Failed to remove signature from container
et: Allkirja eemaldamine ümbrikust ebaõnnestus

source: Failed to rename file %@
et: Faili %@ ümbernimetamine ebaõnnestus

source: Failed to save file %@
et: Faili %@ salvestamine ebaõnnestus

source: File
et: Fail

source: File %@ saved
et: Fail %@ salvestatud

source: File successfully added
et: Fail edukalt lisatud

source: Files successfully added
et: Failid edukalt lisatud

# Forgot PIN
source: Forgot %@?
et: Unustasid %@-koodi?

# General error
source: Something went wrong, try again
et: Midagi läks valesti, proovi uuesti

source: Given names
et: Eesnimi

source: Hash value of signature
et: Allkirja sõnumilühend

source: Hide password
et: Peida parooli

source: Hold your ID card against your smart device until the data is read.
et: Hoidke ID-kaarti vastu nutiseadet kuni andmeid loetakse.

# ID card connect card reader
source: Connect the card reader and insert your ID-card into the reader.
et: Ühenda kaardilugeja nutiseadmega ja sisesta ID-kaart lugejasse.

# ID card detected
source: ID-card found. Requesting information...
et: ID-kaart leitud. Pärin andmeid...

source: ID-card number
et: ID-kaardi number

# ID card reader connected
source: Reader found. Insert your ID-card into the reader.
et: Kaardilugeja leitud. Sisesta ID-kaart lugejasse.

# ID card reader process failed
source: Failed to read data. Please reconnect the card reader and try again.
et: Andmete lugemine ebaõnnestus. Palun taasühenda kaardilugeja ja proovi uuesti.

source: ID-card via NFC
et: ID-kaart NFC abil

source: ID-card via USB
et: ID-kaart kaardilugeja abil

source: Identification method
et: Identifitseerimismeetod

source: Identification method changed
et: Identifitseerimismeetod muudetud

# Identification method title
source: Choose a method of identification
et: Vali isiku tuvastamise meetod

# Identification title
source: Identification
et: Identifitseerimine

source: Identify
et: Identifitseeri

# Information system authority
source: Estonian Information System Authority
et: Riigi Infosüsteemi Amet

source: Invalid country code
et: Vigane riigikood

# Invalid file size
source: Cannot add empty file to the container
et: Tühja faili ei saa lisada ümbrikusse

# Invalid Mobile-ID access rights url
source: https://www.id.ee/en/article/for-organisations-that-sign-large-quantities-of-documents-using-digidoc4-client/
et: https://www.id.ee/artikkel/asutustele-kus-allkirjastatakse-digidoc4-kliendi-kaudu-suuremates-kogustes-dokumente/

# Invalid personal code
source: Personal code is not valid
et: Isikukood pole korrektne

# Invalid phone number
source: Phone number is not valid
et: Telefoninumber pole korrektne

# Invalid proxy settings
source: Failed to connect with service server. Please check your network settings or try again later
et: Teenuse serveriga ühendus ebaõnnestus. Palun kontrolli võrgu sätteid või proovi hiljem uuesti

# Invalid signature
source: %d invalid signatures
et: %d allkirja ei kehti

# Invalid signing access rights
source: Failed to sign container. Check your %@ service access settings
et: Ümbriku allkirjastamine ebaõnnestus. Kontrolli %@ teenuse ligipääsu seadeid

source: Latvia
et: Läti

source: Lithuania
et: Leedu

source: Loading
et: Laen

# Main about help center
source: ID helpdesk
et: ID-abikeskus

# Main about info
source: Estonian ID software is issued by the Estonian Information System Authority. If you have any questions, please contact:
et: Eesti ID-tarkvara on välja antud Riigi Infosüsteemi Ameti poolt. Küsimuste korral pöördu:

# Main about licenses title
source: Additional licenses and components
et: Täiendavad litsentsid ja komponendid

# Main about version title
source: version %@
et: versioon %@

# Main accessibility introduction
source: RIA DigiDoc is designed to comply with the WCAG 2.1 AA accessibility guidelines. This means that the RIA DigiDoc application has been developed using the principles that the application should be usable by the blind and people with visual, mobility, and strength impairments.
et: RIA DigiDoc on ehitatud nii, et see vastaks WCAG 2.1 AA juurdepääsetavuse suunistele. See tähendab, et RIA DigiDoc rakenduse arendamisel on kasutatud põhimõtteid, et see oleks kasutatav ilma nägemisvõimeta, piiratud nägemisvõimega, piiratud liikumisvõime või jõuga jms.

# Main accessibility introduction 2
source: Accessibility can be improved by using built-in assistive tools on your smart device. You can find an overview of the main assistive tools below.
et: Juurdepääsetavust on võimalik parandada oma nutiseadmesse sisseehitatud abivahendeid kasutades. Alljärgnevalt ülevaade põhilistest abivahenditest.

# Main accessibility introduction screen magnification introduction
source: If you have enough vision to read the text, you can use the built-in assistive tools to view the screen more comfortably. Assistive tools make it possible to change the size of text, the main font, and the colours of the user interface and enlarge the screen by using the screen magnifier.
et: Kui nägemisjääk teksti lugemiseks on piisav, on võimalik mugavamaks ekraani vaatamiseks kasutada nutiseadmesse sisseehitatud abivahendeid. Abivahendeid kasutades on võimalik muuta tekstide suurusi, peamist kirjatüüpi, kasutajaliidese värvilahendusi ning ekraani suurendada, kasutades ekraaniluupi.

# Main accessibility introduction screen magnification screen tools
source: Tools to adjust screen colour and text size:
et: Ekraani värvi ja teksti suuruse reguleerimise abivahendid:

# Main accessibility introduction screen magnification screen tools ios url
source: https://support.apple.com/en-gb/guide/iphone/iph3e2e1fb0/ios
et: https://support.apple.com/et-ee/guide/iphone/iph3e2e1fb0/ios

# Main accessibility introduction screen magnification title
source: Screen magnification and colour change
et: Ekraani suurendus ja värvide muutmine

# Main accessibility introduction screen magnification tools
source: Screen magnification tools:
et: Ekraani suurendamise abivahendid:

# Main accessibility introduction screen magnification tools android
source: Magnification (Android, built in)
et: Magnification (Android, sisseehitatud)

# Main accessibility introduction screen magnification tools ios
source: Zoom (iOS, built in)
et: Zoom (iOS, sisseehitatud)

# Main accessibility introduction screen magnification tools ios url
source: https://support.apple.com/en-gb/guide/iphone/iph3e2e367e/ios
et: https://support.apple.com/et-ee/guide/iphone/iph3e2e367e/ios

# Main accessibility introduction screen reader introduction
source: A screen reader is a program that converts the information on the screen of a smart device into a user-friendly output, for instance, into speech. In particular, it is a tool for the visually impaired.
et: Ekraanilugeja on programm, mille ülesandeks on muuta nutiseadme ekraanil kujutatavat informatsiooni kasutajale sobivaks väljundiks – näiteks kõneks. Eelkõige on see abivahend vaegnägijate jaoks.

# Main accessibility introduction screen reader introduction 2
source: RIA DigiDoc has been built based on the principle that all types of visual content can be converted into user-friendly output. For example, the images are accompanied by textual descriptions. Furthermore, the arrangement and order of the structural elements consider the screen reader’s movement on the screen and allow the information to be consumed in a logical sequence.
et: RIA DigiDoc ehitamisel on arvestatud, et igat tüüpi visuaalset sisu oleks võimalik muuta kasutajale sobivaks väljundiks. Näiteks on piltidel küljes tekstilised kirjeldused, struktuursete elementide paigutus ja järjekord arvestab ekraanilugeja liikumist ekraanil ja võimaldab infot tarbida loogilises järjekorras.

# Main accessibility introduction screen reader introduction android
source: Talkback (Android, built in)
et: Talkback (Android, sisseehitatud)

# Main accessibility introduction screen reader introduction apps
source: The most common smart device screen readers:
et: Levinumad nutiseadme ekraanilugejad:

# Main accessibility introduction screen reader introduction ios
source: VoiceOver (iOS, built in)
et: VoiceOver (iOS, sisseehitatud)

# Main accessibility introduction screen reader introduction ios url
source: https://support.apple.com/en-gb/guide/iphone/iph3e2e415f/ios
et: https://support.apple.com/et-ee/guide/iphone/iph3e2e415f/ios

# Main accessibility introduction screen reader title
source: Screen reader
et: Ekraanilugeja

# Main accessibility more info
source: More information can be found on here:
et: Rohkem infot leiab

# Main accessibility title
source: Accessibility
et: Ligipääsetavuse info

# Main diagnostics application version title
source: Application version:
et: Rakenduse versioon:

# Main diagnostics central configuration title
source: Central configuration:
et: Konfiguratsiooni andmed:

# Main diagnostics configuration check for update button
source: Refresh configuration
et: Kontrolli värskendusi

# Main diagnostics configuration last check date
source: LAST CHECK
et: VIIMATI KONTROLLITUD

# Main diagnostics configuration save diagnostics button
source: Save diagnostics
et: Salvesta diagnostika

# Main diagnostics configuration update date
source: UPDATE DATE
et: UUENDAMISE KUUPÄEV

# Main diagnostics libraries title
source: Libraries:
et: Teegid:

# Main diagnostics logging switch
source: Enable one-time log generation
et: Aktiveeri ühekordne logifaili genereerimine

# Main diagnostics operating system title
source: OS:
et: Operatsioonisüsteem:

# Main diagnostics restart message
source: Restart RIA DigiDoc to activate logging.
et: Logimise aktiveerimiseks taaskäivita RIA DigiDoc.

# Main diagnostics restart message restart now
source: Restart now?
et: Taaskäivita rakendus?

# main diagnostics restart message url
source: https://www.id.ee/en/article/log-file-generation-in-digidoc4-client/
et: https://www.id.ee/artikkel/logifaili-genereerimine-digidoc4-kliendis/

# Main diagnostics rpuuid custom
source: is set manually
et: käsitsi määratud

# Main diagnostics rpuuid default
source: is set by default
et: vaikimisi määratud

# Main diagnostics save log
source: Save log
et: Salvesta logifail

# Main diagnostics title
source: Diagnostics
et: Diagnostika

# Main diagnostics tsl cache title
source: TSL cache:
et: TSL puhver:

# Main diagnostics urls title
source: URLs:
et: URLid:

# Main home crypto description
source: Add a file for encryption or decryption
et: Krüpteerimiseks või dekrüpteerimiseks lisa fail

# Main home crypto title
source: Crypto
et: Krüpto

# Main home menu about
source: About DigiDoc app
et: RIA DigiDoc äpi kohta

# Main home menu accessibility
source: Accessibility
et: Ligipääsetavuse info

# Main home menu diagnostics
source: Diagnostics
et: Diagnostika

# Main home menu help url
source: https://www.id.ee/en/id-help/
et: https://www.id.ee/id-abikeskus/

# Main home my eid description
source: View or edit your eID details
et: Vaata või muuda oma eID andmeid

# Main home my eid title
source: My eID
et: Minu eID

# Main home open document description
source: Find the file or document you need
et: Leia vajalik fail või dokument

# Main home open document title
source: Files
et: Failid

# Main home signature description
source: Add file for signature or verification
et: Allkirjastamiseks või kontrollimiseks lisa fail

# Main home version
source: version %@
et: versioon %@

# Main settings ask role and address title
source: Ask role and address info on signing
et: Küsi rolli ja aadressi igal allkirjastamisel

# Main settings cert expired
source: Expired
et: Aegunud

# Main settings cert issued to title
source: Issued to:
et: Kellele väljastatud:

# Main settings cert valid to title
source: Valid to:
et: Kehtib kuni:

# Main settings crypto certificate title
source: Key transfer server SSL certificate
et: Võtmeedastusserveri SSL sertifikaat

# Main settings crypto choose server option
source: Choose server
et: Vali server

# Main settings crypto server option manual
source: Use a manually specified key transfer server for encryption
et: Kasuta krüpteerimiseks käsitsi määratud võtmeedastusserverit

# Main settings crypto services title
source: Encryption settings
et: Krüpteerimisseaded

# Main settings crypto use cdoc1
source: Use CDOC1 file format for encryption
et: Kasuta krüpteerimiseks CDOC1 failiformaati

# Main settings crypto use cdoc2
source: Use CDOC2 file format for encryption
et: Kasuta krüpteerimiseks CDOC2 failiformaati

# Main settings crypto use key transfer
source: Use a key transfer server for encryption
et: Kasuta krüpteerimiseks võtmeedastusserverit

# Main settings default access title
source: Use default access
et: Kasuta vaikimisi määratud ligipääsu

# Main settings default manual access title
source: Use manually configured access
et: Kasuta käsitsi määratud ligipääsu

# Main settings general title
source: General
et: Üldine

# Main settings menu advanced
source: Advanced settings
et: Täpsemad seaded

# Main settings menu appearance
source: Appearance
et: Välimus

# Main settings menu language
source: Language selection
et: Keelevalik

# Main settings mobile id and smart id title
source: Mobile-ID and Smart-ID
et: Mobiil-ID ja Smart-ID

# Main settings proxy check connection
source: Check connection
et: Kontrolli internetiühendust

# Main settings proxy check connection success
source: Internet connection available!
et: Internetiühendus on olemas!

# Main settings proxy check connection unsuccessful
source: No internet connection!
et: Internetiühendus puudub!

# Main settings proxy manual
source: Manual proxy configuration
et: Kasuta käsitsi määratud proksiseadeid

# Main settings proxy no proxy
source: No proxy
et: Ei kasuta proksit

# Main settings proxy password
source: Password
et: Parool

# Main settings proxy title
source: Proxy
et: Proksi

# Main settings proxy use system
source: Use system proxy settings
et: Kasuta süsteemseid proksiseadeid

# Main settings proxy username
source: Username
et: Kasutajanimi

# Main settings relying party title
source: Access to mobile-ID and Smart-ID service
et: Ligipääs mobiil-ID ja Smart-ID teenusele

# Main settings signing services title
source: Signing services
et: Allkirjastamisteenused

# Main settings siva certificate title
source: Digital Signature Validation Service SiVa SSL certificate
et: Valideerimisteenuse SiVa SSL sertifikaat

# Main settings siva service title
source: Access to Digital Signature Validation Service SiVa
et: Ligipääs valideerimisteenusele SiVa

# Main settings siva service url
source: SiVa service URL
et: SiVa valideerimisteenuse URL

# Main settings system settings title
source: System settings
et: Süsteemiseaded

# Main settings theme dark
source: Dark
et: Tume

# Main settings theme light
source: Light
et: Hele

# Main settings theme system
source: System default
et: Süsteemi vaikeseade

# Main settings timestamp cert add certificate button
source: Add certificate
et: Lisa sertifikaat

# Main settings timestamp cert not added
source: Certificate not added
et: Sertifikaati ei ole lisatud

# Main settings timestamp cert show certificate button
source: Show certificate
et: Näita sertifikaati

# Main settings timestamp cert title
source: Time-Stamping service SSL certificate
et: Ajatempliteenuse SSL sertifikaat

# Main settings timestamp services title
source: Time-Stamping service
et: Ajatempliteenus

# Main settings tsa url title
source: Access to Time-Stamping service
et: Ligipääs ajatempliteenusele

# Main settings use default settings button title
source: Use default settings
et: Taasta algseaded

# Main settings use default settings message
source: Default settings restored
et: Algseaded taastatud

# Main settings validation services title
source: Validation services
et: Valideerimisteenused

source: Menu
et: Menüü

# Menu language
source: Language
et: Keel

# Menu language selected
source: Language selected
et: Keel valitud

# Menu theme
source: Theme
et: Teema

# Menu theme selected
source: Theme selected
et: Teema valitud

source: mobile-ID
et: mobiil-ID

# Mobile-ID incorrect parameters
source: Incorrect mobile number and/or personal code, non-Estonian mobile numbers must be prefixed with the country code
et: Vigane telefoninumber ja/või isikukood, välismaa telefoninumber peab algama riigikoodiga

source: More options
et: Veel valikuid

# Multiple documents already exist
source: %@ files already exist in the container
et: %@ faili on juba ümbrikus olemas

source: My data
et: Minu andmed

# My eid status expired
source: Expired
et: Aegunud

# My eid status unknown
source: Unknown
et: Teadmata

# My eid status valid
source: Valid
et: Kehtib

# New PIN difference requirement
source: New %1$@ must be different from current %1$@.
et: Uus %1$@ peab olema erinev eelmisest.

source: Next
et: Edasi

# NFC card detected
source: Hold your phone near the ID-card
et: Hoia ID-kaarti telefoni lähedal

# NFC hold card
source: Hold your phone near the ID-card
et: Hoia ID-kaarti telefoni lähedal

# NFC not supported
source: This device does not support contactless connection
et: See seade ei toeta kontaktivaba ühendust

# No Internet connection
source: Please check your internet connection
et: Palun kontrolli internetiühendust
